In [1]:
import pandas as pd

import pandas as pd

# Series ->
### A Series is a one-dimensional array-like object in pandas that can hold data of any type and has labels(called index) associated with each element.

## create a series by list

In [2]:
data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

## create a series by dict

In [3]:
data = {'a':1,'b':2,'c':3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [4]:
# create own index 

data = [1,2,3]
ind = ['a','b','c']
series = pd.Series(data,ind)
print(series)

a    1
b    2
c    3
dtype: int64

In [ ]:
        ## create a datafream dict of list
import pandas as pd
import getpass  # To get the system's current username


data = {
    'name': ['subho', 'ranu', 'babai'],
    'age': [19, 18, 16],
    'class': [1, 2, 3]
}

df = pd.DataFrame(data)


username = getpass.getuser()
df.loc[2, 'name'] = username  
print(df)

    name  age  class
0  subho   19      1
1   ranu   18      2
2  apple   16      3

In [6]:


# create a data fream using list of dict of dict 

data = [
    {'name':'subho','age':19},
    {'name':'ranu','age':18},
    {'name':'babai','age':16},
]

df = pd.DataFrame(data)
df

    name  age
0  subho   19
1   ranu   18
2  babai   16

In [7]:
                # read a csv file using pandas

df = pd.read_csv('student.csv')  # âœ… correct filename

df.head(5)       # it return data form first
df.tail(5)       # it return data form last

,Product_ID,Name,Category,Price,Stock_Quantity,Supplier,prise_missing,New_Price
15,P016,SSD 1TB,Electronics,6500.0,75.0,NaN,6500.00,13000.0
16,P017,HDD 2TB,Electronics,5000.0,60.0,Supplier M,5000.00,10000.0
17,P018,Graphics Card,Electronics,NaN,20.0,Supplier N,12718.75,NaN
18,P019,Motherboard,Electronics,8500.0,NaN,Supplier O,8500.00,17000.0
19,P020,Power Supply,Electronics,4000.0,90.0,NaN,4000.00,8000.0

In [8]:

                    # get the data form the data frame

data = {
    'name':['subho','ranu','babai'],
    'age': [19,18,16],
    'class': [1,2,3]
}
df = pd.DataFrame(data)
# normally

df['name'][0]

            # using function
# df.loc[0]            # it give the data by column
df.iloc[0]            # it give the data by row
# df.at[1,'age']           # it give the specified item
# df.iat[1,1]           # it give the specified item by row index and col index

name     subho
age         19
class        1
Name: 0, dtype: object

In [9]:
                # data manupulation
                
df['salary'] = [1000000000,1,10]            # add a column
print(df.drop('salary',axis=1,inplace=True))

df['age' ] = df['age']+1            # add age +1
df.drop(1,inplace=True)             #remove 2nd row
df

None

    name  age  class
0  subho   20      1
2  babai   17      3

In [10]:

                # get ave mark
                
import pandas as pd
import numpy as np

data = {
    'Name': ['Ram', 'Sita', 'Laxman', 'Hanuman'],
    'Maths': [82, 95, 70, 88],
    'Physics': [87, 85, 80, 90],
    'Chemistry': [98, 78, 85, 88]
}

df = pd.DataFrame(data)

df['total'] = df[['Maths','Physics','Chemistry']].sum(axis=1)
df['Average'] = np.round(df['total']/3,2)
df['Grade'] = df['Average'].apply(lambda x: 'A' if x >= 85 else 'B' if x >= 70 else 'C')

topper = df.loc[df['total'].idxmax()]
print('topper is: ',topper['Name'])

print(df)

df.to_csv('result.csv',index=True)

topper is:  Ram
      Name  Maths  Physics  Chemistry  total  Average Grade
0      Ram     82       87         98    267    89.00     A
1     Sita     95       85         78    258    86.00     A
2   Laxman     70       80         85    235    78.33     B
3  Hanuman     88       90         88    266    88.67     A